import { Component } from '@angular/core';

@Component({
  selector: 'app-clients-tell',
  imports: [],
  templateUrl: './clients-tell.component.html',
  styleUrl: './clients-tell.component.scss'
})
export class ClientsTellComponent {
  types = [{ name: "🛠️ טכני (Realistic – ריאלי-טכני)", description: "אנשים ריאליים מעדיפים עבודה מעשית עם חפצים, כלים או סביבה פיזית. הם נמשכים למשימות הדורשות מיומנות טכנית, עבודה עם מכונות, בנייה, תיקון או פעילות בשטח. לרוב הם נמנעים מעיסוקים מופשטים או חברתיים מדי.\nמקצועות אופייניים: טכנאי, מהנדס, שוטר, טייס, מכונאי, חשמלאי." },
  { name: "🔬 חקרני (Investigative – מדעי)", description: "הטיפוס החקרני מתעניין במדע, נתונים ותאוריות. הוא נהנה לנתח, לחקור ולפתור בעיות מורכבות תוך שימוש בחשיבה אנליטית ומופשטת. נוטה להיות סקרן, אינטלקטואלי ואוהב למידה מתמשכת.\nמקצועות אופייניים: חוקר, מתמטיקאי, ביולוג, כימאי, מתכנת, לבורנט."}, 
  { name: "🎨 אמנותי (Artistic – אומנותי)", description: "הטיפוס האמנותי מתאפיין בצורך בביטוי עצמי, יצירתיות ודמיון. הוא נמשך לעיסוקים בלתי שגרתיים, אוהב תרבות, אסתטיקה וחדשנות, ולעיתים נמנע ממסגרות קשוחות ושגרתיות.\nמקצועות אופייניים: מעצב גרפי, סופר, מוזיקאי, אדריכל, שחקן, קופירייטר."}, 
  { name: "🤝 חברתי (Social – חברתי)", description: "\nאנשים חברתיים מעדיפים לעסוק בעבודה עם אנשים אחרים, לסייע, ללמד, לחנך או להדריך. הם טובים ביחסי אנוש, תקשורת והקשבה, ומונעים מתוך רצון לעזור לאחרים וליצור חיבור.\nמקצועות אופייניים: מורה, פסיכולוג, עובד סוציאלי, מנחה קבוצות, יועץ חינוכי, מדריך." },
  { name: "🚀 יזמי (Enterprising – יזמי/עסקי)", description: "הטיפוס היזמי שואף להוביל, לנהל, לשכנע ולהשפיע. הוא מתאפיין בביטחון עצמי, כושר ביטוי ויכולת להניע אחרים. יעדיף עיסוקים הכרוכים ביזמות, מכירות וניהול, ופחות יתמקד בעבודה שגרתית.\nמקצועות אופייניים: מנהל, יועץ ארגוני, פוליטיקאי, איש מכירות, יזם עסקי." },
  { name: "📊 מנהלי (Conventional – ארגוני)", description: "הטיפוס הקונבנציונלי אוהב סדר, ארגון, עבודה עם נתונים, נהלים וחוקים ברורים. הוא שיטתי, מדויק ושם דגש על משמעת וסדר. יעדיף עיסוקים משרדיים, ניהוליים או חשבונאיים.\nמקצועות אופייניים: רואה חשבון, מנהל חשבונות, סטטיסטיקאי, מזכיר, פקיד בנק, בקר איכות."} 
 
  ]

}
